{
  "meta": {
    "name": "Jim Cresswell",
    "headline": "Understanding systems, shaping change",
    "headline_alt": "The questions keep getting bigger",
    "summary": "Shaping high-impact problems for people and planet — AI-powered knowledge systems, national-scale public services, and public digital infrastructure.",
    "locale": "en-GB"
  },
  "positioning": {
    "paragraphs": [
      "I'm drawn to problems that don't have shape yet — in digital‑first public services, AI‑mediated access to trusted knowledge, community‑driven systems change, and the structure of the early Universe. My work is to find the underlying structure: the frame that turns ambiguity into something that can be confidently delivered against. Shaping the problem is my creative act.",
      "My background spans digital product creation, software engineering, research, and building national‑scale public services — the common thread is origination: zero‑to‑one work, before problems have operational form. I set direction early, decide what should and should not be built, and hold that so others can build with confidence. Part of the work is recognising when the existing system is the wrong starting point and shaping what replaces it. The impact I care about is long‑term and structural: changing constraints in large‑scale systems so that the natural paths lead to different, better outcomes, lasting far beyond my direct involvement."
    ]
  },
  "experience": [
    {
      "organisation": "Oak National Academy",
      "role": "Exploratory Leadership in Digital‑First Public Services",
      "start_year": 2020,
      "end_year": "present",
      "summary": [
        "At [Oak National Academy](https://www.oaknational.org.uk/), I lead on complex, high‑impact problems by setting foundational technical and product direction inside a live national public service, giving teams a clear frame to build against with confidence. My responsibility sits in early and unstructured contexts where problem spaces are not yet defined, and decisions about what should and should not be built have direct consequences for teachers' workload, educational quality, and pupil safeguarding.",
        "At a critical point, I argued for a deeper intervention to address structural delivery risk that was compounding over time, and stood behind that decision as it was taken forward. Change complexity was increasing non‑linearly, delivery pace was slowing, and meaningful innovation was becoming increasingly constrained. Rather than pursuing incremental optimisation, I backed a rebuild, accepting and managing near‑term delivery and reputational risk to avoid a later, higher‑cost failure under significantly greater delivery pressure. Four years on, the platform continues to sustain active development and innovation.",
        "More recently, my work has focused on treating Oak's openly licensed [curriculum data](https://open-api.thenational.academy/) as public digital infrastructure rather than a product destination. This has included exposing it through a clear SDK and AI‑first machine-accessible interfaces (MCP), so high-quality curriculum materials can be accessed where teachers and developers already work, including AI‑mediated environments. The intent is deliberately indirect, reflecting organisational constraints and long‑term leverage considerations: to preserve optionality, lower the cost of access to trusted public data, and enable others to build tools and practices over time. Across Oak, I have held responsibility for early trade-offs that fixed architectural direction, constrained later options, and materially expanded the organisation's long‑term ability to innovate safely."
      ]
    }
  ],
  "prior_roles": [
    {
      "title": "Research & Sense-Making in Unknown Systems",
      "description": [
        "My academic background trained me to work deep into the unknown: forming and testing models, reasoning about complex systems at scale, and reframing problems where existing assumptions break down.",
        "My [published research](https://scholar.google.co.uk/citations?hl=en&user=7yf2vEEAAAAJ) in cosmology and large‑scale structure focused on anomalous phenomena, prioritising conceptual exploration where incremental understanding was not the right tool.",
        "This work shaped how I think about systems, uncertainty, and second and third‑order effects — instincts that now underpin my exploratory leadership outside academia.",
        "This period also included non‑academic work focused on systems change and leverage points: analysing how shifts in constraints, defaults, and access pathways alter outcomes over time — a lens that now informs my emphasis on enabling ecosystems rather than building destinations."
      ]
    },
    {
      "title": "Applied Exploration in Complex Technical Contexts",
      "description": [
        "Before Oak, I worked across technical environments in the public and private sectors, including the Financial Times Labs, HMPO [the UK Passport Service](https://www.gov.uk/apply-renew-passport), British Airways, and early‑career roles at HP Labs.",
        "At HMPO I normalised specification workshops, establishing shared understanding through whole‑team example creation, massively reducing rework.",
        "Across other roles, I repeatedly shifted technical context rather than optimising within it: instigating the move from bespoke version control to Git and GitHub at British Airways; contributing to the award‑winning FT Web App at FT Labs; and automating manual testing at HP Labs while teaching others to adopt the same systems.",
        "Across these roles, the consistent thread was clarifying intent, surfacing hidden assumptions, and shaping systems that could evolve stably under real‑world pressure."
      ]
    },
    {
      "title": "Grounded Practice",
      "description": [
        "My undergraduate thesis was on the design and construction of a [Theremin](https://en.wikipedia.org/wiki/Theremin) — an early interest in building at the intersection of physics, craft, and play.",
        "I previously volunteered as a market gardener with Growing Communities, an organic local‑food initiative. I keep an allotment, and breed runner beans and sunflowers, selecting for resilience and genetic diversity.",
        "I'm interested in ecology‑informed food growing, and how perennial systems shift resilience and yield stability in food and materials supply systems."
      ]
    }
  ],
  "capabilities": [
    "Zero-to-one technical leadership — I set architectural direction at [national scale](https://www.oaknational.org.uk/) and hold the early decisions that shape long-term innovation and reach.",
    "Designing and building AI-first interfaces — I conceived, prototyped, and delivered Oak's SDK and MCP server end-to-end, making [openly licensed curriculum data](https://open-api.thenational.academy/) accessible as public digital infrastructure in AI‑mediated environments. I built [this site](https://github.com/jimCresswell/jimcresswell.net) myself, with [exploratory AI tooling processes](https://github.com/jimCresswell/jimcresswell.net/tree/main/.agent).",
    "Research-trained reasoning and systems understanding — computational modelling and [published research](https://scholar.google.co.uk/citations?hl=en&user=7yf2vEEAAAAJ) in astrophysics. I carry this rigour; I deploy it where it creates the most leverage.",
    "Strategy and technical leadership at scale — I helped shape [Oak's](https://www.oaknational.org.uk/) Engineering function from four contractors into five product squads and three platform groups. I hold space for team direction within the long-term vision and standards, translating technical direction for non-technical stakeholders, coaching others, and making the ambiguous navigable.",
    "System-level impact through public services — my technical and strategic work at [Oak](https://www.oaknational.org.uk/) contributes to infrastructure that supports education quality and teacher wellbeing, in the UK and beyond."
  ],
  "education": [
    {
      "degree": "PhD",
      "field": "Astrophysics & Cosmology",
      "institution": "University of Portsmouth"
    },
    {
      "degree": "MSc",
      "field": "Cosmology",
      "institution": "University of Sussex"
    },
    {
      "degree": "MPhys",
      "field": "Physics",
      "institution": "University of Bath"
    }
  ],
  "links": {
    "email": "contact@jimcresswell.net",
    "linkedin": "https://www.linkedin.com/in/jimcresswell",
    "github": "https://github.com/jimCresswell",
    "google_scholar": "https://scholar.google.co.uk/citations?user=7yf2vEEAAAAJ&hl=en",
    "shiv": "https://www.sphericalhorseinavacuum.com/"
  },
  "tilts": {
    "_meta": {
      "primary": "public_sector",
      "order": ["public_sector", "private_ai", "founder"],
      "web_routes": ["public_sector"],
      "note": "primary is the default variant; others are contextual reframings, not alternatives. Only web_routes variants are exposed on the website; all variants are available for PDF generation."
    },
    "public_sector": {
      "context": "UK Civil Service / Public AI Leadership",
      "positioning": "I work on complex, long‑term problems where AI, data, and public services intersect, particularly in early or unstructured contexts where new forms of public value and access are possible but not yet well understood. I lead exploratory work that reframes what public services could offer, unlocking novel ways for people to benefit from shared data and digital capability. My focus is on shaping the early conditions for high‑impact use of AI in public systems, enabling others to create value responsibly and at scale."
    },
    "private_ai": {
      "context": "Private AI Companies / Frontier Exploration",
      "positioning": "I work on complex, early‑stage problem spaces at the frontier of AI capability, where the right questions are not yet clear and premature solutions can distort long‑term value. I lead exploratory work that reframes problems, identifies leverage, and gives initial shape to systems before they become products. My strength is turning ambiguity into coherent direction, enabling others to build with lasting impact."
    },
    "founder": {
      "context": "Founder / Origination",
      "positioning": "I explore complex, high‑impact problem spaces where existing models no longer fit and new systems are required. My work centres on discovery and creation: forming new conceptual frameworks, testing what is worth building at all, and shaping the first coherent versions of ideas that can grow beyond me. I'm driven by origination, leverage, and impact that emerges through others rather than incremental optimisation."
    }
  }
}
