{
  "header": {
    "name": "Jim Cresswell",
    "title": "Principal Engineer",
    "email": "jim@jimcresswell.net",
    "linkedin": "https://linkedin.com/in/jimcresswell"
  },
  "introductory_summary": [
    "Jim Cresswell is a Principal Engineer with a focus on sustainable development, high-quality digital products, and impactful solutions. Recognised for his strategic thinking and practical approach, he brings strengths in defining and leading technical strategies, coaching teams, and balancing organisational needs with technical excellence. Jim’s approach centres on collaboration, empowering teams to deliver their best work, and fostering a low-stress environment that not only enhances product quality and release cadence but also builds collaborative and effective teams.",
    "As the principal engineer for the national education platform Oak National Academy, Jim has directed technical strategy, influenced organisational culture, and led significant product rebuilds, working closely with product, business, and leadership teams. His passions include ecological and social impact, open-source software, and building resilient, high-quality services. His problem-solving and decision-making is research-driven and forward-looking, with a focus on prototyping and sustainable, long-term solutions."
  ],
  "experience": [
    {
      "company": "Oak National Academy",
      "website": "https://www.thenational.academy/",
      "roles": [
        {
          "title": "Principal Engineer",
          "dates": "June 2022 - Present",
          "description": [
            "Leading app development, cloud infrastructure, and developer experience at Oak National Academy.",
            "Focus on product strategy, CI/CD, developer experience, and overall cloud architecture.",
            "Collaborated closely with stakeholders on strategic decision-making, digital strategy, and technical leadership.",
            "Technologies used: Google Cloud Platform, Cloudflare, GitHub, Vercel, React, Next.js."
          ]
        },
        {
          "title": "Head of DevOps and Quality (Consulting)",
          "dates": "January 2021 - June 2022",
          "description": [
            "Led CI/CD, testing strategy, and developer experience for Oak National Academy's remote edtech apps.",
            "Collaborated with cloud service providers including Google Cloud Services, Cloudflare, GitHub, Vercel, BrowserStack, and SonarCloud."
          ]
        },
        {
          "title": "Senior Developer (Consulting)",
          "dates": "August 2020 - December 2020",
          "description": [
            "Helped develop the Oak National Academy remote edtech apps from an early stage.",
            "Worked with React, Next.js, GraphQL, and a variety of cloud data and service providers.",
            "Drove improvements on code quality, CI, automated testing, and engineering best practices."
          ]
        }
      ]
    },
    {
      "company": "Code Science Limited",
      "roles": [
        {
          "title": "Managing Director",
          "dates": "February 2018 - Present",
          "description": [
            "Provided strategic and technology consulting to both public and private sector clients.",
            "Specialised in cloud computing, web applications, solution-oriented strategies, and open-source development."
          ]
        }
      ]
    },
    {
      "company": "Obaith",
      "website": "https://web.archive.org/web/20211114073948/https://www.obaith.com/",
      "roles": [
        {
          "title": "Founder",
          "dates": "January 2018 - December 2020",
          "description": [
            "Led a tech for good project focused on exploring how digital services can support climate breakdown, biodiversity, and social connection through community projects.",
            "Conducted full-time research on system change, leverage points, and scalable solutions to support positive change.",
            "Built networks and gathered information to support future projects."
          ]
        }
      ]
    },
    {
      "company": "The Home Office (part-remote)",
      "website": "https://www.gov.uk/apply-renew-passport",
      "roles": [
        {
          "title": "Programme QA Consultant",
          "dates": "February 2017 - December 2017",
          "description": [
            "Led QA automation strategy across an agile programme of 2 projects and 6 scrum teams creating a micro-service architecture public-facing web service.",
            "Created and coached teams on human-readable, automatically validated product specifications using Cucumber, JavaScript, Java, and Webdriver.",
            "Coordinated with architects, programme leads, analysts, and technical leads to ensure comprehensive automated validation and rapid feedback."
          ]
        }
      ]
    },
    {
      "company": "FT Labs (Financial Times)",
      "website": "http://labs.ft.com/",
      "roles": [
        {
          "title": "Senior Developer",
          "dates": "August 2011 - July 2014",
          "description": [
            "Joined FT Labs during its transition from startup Assanka to the Financial Times, working as a web developer on the award-winning cross-platform HTML5 FT web app.",
            "Led QA automation and strategy, introducing end-to-end testing using WebDriver (Java) and Jenkins, with a focus on continuous integration and delivery velocity.",
            "Took technical lead on the FT Windows 8 app and contributed to experimental projects, including the FT FirefoxOS app."
          ]
        }
      ]
    },
    {
      "company": "British Airways (part-remote)",
      "website": "https://www.britishairways.com/",
      "roles": [
        {
          "title": "QA Automation Consultant",
          "dates": "March 2015 - December 2015",
          "description": [
            "Provided education and training on Specification by Example (BDD) and unit/integration testing approaches (TDD).",
            "Supported long-term strategies around continuous testing and delivery, including adoption of cloud technologies and incremental migration to microservices architecture.",
            "Drove awareness and adoption of software delivery best practices among executive, design, and development teams through planning, presentations, and digital communication."
          ]
        }
      ]
    },
    {
      "company": "Hewlett-Packard Laboratories for N-able",
      "roles": [
        {
          "title": "Systems Engineer",
          "dates": "April 2009 - November 2010",
          "description": [
            "Carried out software and hardware test plan design and execution for an HP storage product.",
            "Organised manual efforts into a team effort to create a test automation framework in Perl, which was used internally by HP for several years."
          ]
        }
      ]
    },
    {
      "company": "Institute for Cosmology and Gravitation, University of Portsmouth",
      "roles": [
        {
          "title": "PhD Researcher",
          "dates": "September 2005 - December 2010",
          "description": [
            "Planned and carried out research projects at the Institute for Cosmology and Gravitation, developing mathematical models and computational pipelines.",
            "Applied models to large astrophysical data sets using data from the Galaxy Zoo citizen science project.",
            "Used model fitting algorithms and data visualisation techniques in C, Matlab, and SQL.",
            "Authored several publications, including thesis: *Luminosity Functions and Galaxy Bias in the Sloan Digital Sky Survey* ([View Thesis](https://drive.google.com/file/d/0B7UZZxXkVSS2UW5ucVRUMkpOVG8/view?usp=sharing))."
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Portsmouth",
      "degree": "PhD in Cosmology and Gravitation",
      "dates": "September 2005 - December 2010",
      "thesis": {
        "title": "Luminosity Functions and Galaxy Bias in the Sloan Digital Sky Survey",
        "link": "https://drive.google.com/file/d/0B7UZZxXkVSS2UW5ucVRUMkpOVG8/view?usp=sharing"
      }
    },
    {
      "institution": "Sussex University",
      "degree": "Master of Science (M.Sc.), Cosmology",
      "dates": "2004 - 2005",
      "thesis": {
        "title": "Observing Cosmological Topology",
        "link": "http://en.wikipedia.org/wiki/Shape_of_the_universe"
      }
    },
    {
      "institution": "University of Bath",
      "degree": "Master of Physics (M.Phys.), Physics",
      "dates": "1998 - 2002",
      "thesis": {
        "title": "The Design and Construction of a Theremin",
        "link": "https://en.wikipedia.org/wiki/L%C3%A9on_Theremin"
      }
    }
  ],
  "skills": [
    "Team Leadership",
    "Product Strategy",
    "Coaching",
    "PostgreSQL",
    "Analytical Skills",
    "Linux",
    "Scripting",
    "Infrastructure Automation",
    "Configuration Management",
    "Technical Leadership",
    "System Architecture",
    "Solution-oriented",
    "Creative Problem Solving",
    "Strategy",
    "Technical Architecture",
    "Open Standards",
    "Open-Source Software",
    "Digital Services",
    "Consulting",
    "Leadership",
    "GraphQL",
    "TypeScript",
    "Digital Strategy",
    "Google Cloud Platform (GCP)",
    "Cloudflare",
    "Project Management",
    "JavaScript",
    "Test Automation",
    "Software Development",
    "Web Applications",
    "Agile Methodologies",
    "TDD",
    "SDLC",
    "CI/CD",
    "DevOps",
    "Node.js",
    "React",
    "Microservices",
    "Quality Assurance",
    "Sustainable Development"
  ],
  "interests": [
    "Putting regenerative processes at the heart of daily life through systems thinking and theories of change.",
    "Exploring ecological solutions to global problems, community networks, and cradle-to-cradle design.",
    "Volunteering as a market gardener with the organic local-food movement Growing Communities.",
    "Running as a councillor in the 2018 UK local elections and considering future campaigns on local issues.",
    "Data visualisation, creating meaningful insights from data, and developing interactive applications."
  ]
}
